HW05/Results/HTML_Load/statistics.json
{
  "POST /api/login" : {
    "transaction" : "POST /api/login",
    "sampleCount" : 214,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.6962616822429895,
    "medianResTime" : 3.0,
    "minResTime" : 2.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 4.0,
    "throughput" : 1.807539297086821,
    "receivedKBytesPerSec" : 1.124598001993361,
    "sentKBytesPerSec" : 0.5813035029520326
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 377,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.716180371352784,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 4.21999999999997,
    "throughput" : 3.182723803734846,
    "receivedKBytesPerSec" : 1.4828412168008982,
    "sentKBytesPerSec" : 1.023703826233411
  },
  "Load_Orders_MyOrders" : {
    "transaction" : "Load_Orders_MyOrders",
    "sampleCount" : 214,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.785046728971961,
    "medianResTime" : 5.0,
    "minResTime" : 2.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 8.0,
    "throughput" : 2.233820459290188,
    "receivedKBytesPerSec" : 1.833460415579332,
    "sentKBytesPerSec" : 1.2657595576722338
  },
  "GET /api/orders/my-orders" : {
    "transaction" : "GET /api/orders/my-orders",
    "sampleCount" : 163,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.742331288343557,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.799999999999983,
    "pct3ResTime" : 5.0,
    "throughput" : 1.3912241919377277,
    "receivedKBytesPerSec" : 0.362750839108763,
    "sentKBytesPerSec" : 0.44756023659346383
  }
}