HW05/Results/HTML_Spike/statistics.json
{
  "POST /api/admin/import-products" : {
    "transaction" : "POST /api/admin/import-products",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1650.3700000000001,
    "medianResTime" : 1604.0,
    "minResTime" : 137.0,
    "maxResTime" : 3638.0,
    "pct1ResTime" : 2955.5,
    "pct2ResTime" : 3264.7999999999997,
    "pct3ResTime" : 3637.68,
    "throughput" : 14.684287812041116,
    "receivedKBytesPerSec" : 5.158142896475772,
    "sentKBytesPerSec" : 54.38062132892805
  },
  "GET /api/products (verify)" : {
    "transaction" : "GET /api/products (verify)",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 150.31999999999996,
    "medianResTime" : 160.0,
    "minResTime" : 8.0,
    "maxResTime" : 334.0,
    "pct1ResTime" : 255.70000000000002,
    "pct2ResTime" : 293.4499999999999,
    "pct3ResTime" : 333.90999999999997,
    "throughput" : 14.965579167913798,
    "receivedKBytesPerSec" : 3538.2582462679584,
    "sentKBytesPerSec" : 4.705973136785393
  },
  "Spike_Admin_Import_Products" : {
    "transaction" : "Spike_Admin_Import_Products",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2042.6899999999996,
    "medianResTime" : 2057.0,
    "minResTime" : 257.0,
    "maxResTime" : 3969.0,
    "pct1ResTime" : 3318.6,
    "pct2ResTime" : 3645.199999999999,
    "pct3ResTime" : 3968.7999999999997,
    "throughput" : 13.65001365001365,
    "receivedKBytesPerSec" : 3245.322071005665,
    "sentKBytesPerSec" : 62.7474064974065
  },
  "POST /api/login (admin)" : {
    "transaction" : "POST /api/login (admin)",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 111.43,
    "medianResTime" : 137.5,
    "minResTime" : 2.0,
    "maxResTime" : 289.0,
    "pct1ResTime" : 218.30000000000004,
    "pct2ResTime" : 254.4999999999999,
    "pct3ResTime" : 288.8299999999999,
    "throughput" : 21.272069772388853,
    "receivedKBytesPerSec" : 13.295043607743034,
    "sentKBytesPerSec" : 5.588073016379494
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 510.6725000000003,
    "medianResTime" : 172.0,
    "minResTime" : 0.0,
    "maxResTime" : 3638.0,
    "pct1ResTime" : 1888.0000000000018,
    "pct2ResTime" : 2462.6,
    "pct3ResTime" : 3303.6200000000003,
    "throughput" : 48.001920076803074,
    "receivedKBytesPerSec" : 2853.141664729089,
    "sentKBytesPerSec" : 55.16470658826353
  },
  "GET /api/categories" : {
    "transaction" : "GET /api/categories",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 130.56999999999996,
    "medianResTime" : 142.0,
    "minResTime" : 0.0,
    "maxResTime" : 300.0,
    "pct1ResTime" : 241.90000000000006,
    "pct2ResTime" : 255.95,
    "pct3ResTime" : 299.8599999999999,
    "throughput" : 20.064205457463885,
    "receivedKBytesPerSec" : 7.014634329855538,
    "sentKBytesPerSec" : 6.348440008025682
  }
}